{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# AUEB M.Sc. in Data Science (part-time)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "**Course**: Data Mining\n",
    "\n",
    "**Semester**: Winter 2020\n",
    "\n",
    "**2nd homework**: Neo4j Graph database\n",
    "\n",
    "**Professor**: Y.Kotidis\n",
    "\n",
    "**Assistant responsible for this assignment**: I.Filippidou\n",
    "\n",
    "\n",
    "Team members:\n",
    "\n",
    "- Spiros Politis (p3351814)\n",
    "\n",
    "- Manolis Proimakis (p3351815)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Assignment Description (General)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "> All scripts have been done using **cypher**, python was only used for presentation purposes as an alternative to Neo4j Desktop, and cypher console."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "> Queries can be seen in this report but a copy of them is also copied to `queries.cy` file."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Dataset"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "You are given the DBLP citation network, which contains authors, articles, venues and citations between articles. In particular, the dataset contains 184313 articles with id, title, year and abstract (don’t use the number of citations property), 80299 authors with names, 4 venues with names and 289908 citations among papers. You can download the dataset (Citation Network Dataset) from e-class in json format."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Property graph model"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "You are asked to model the data as a property graph by designing the appropriate entities and assigning the relevant labels, types and properties. For your modeling, you need to study the details of all the files that describe the citation network and represent all network attributes on nodes and edges of a graph. In your model you should include only the attributes that describe each node and edge type, without repetitions of elements (e.g. same property being displayed on both a node and an edge). Finally, nodes should not be connected when this is not required by the model."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Part 1 - Creating the graph and querying"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Importing the dataset into Neo4j"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Based on your model, **you should create a graph database on Neo4j and load the citation network elements (nodes, edges, attributes)**. You can load the dataset directly from the json files provided in e-class for this assignment by using either the neo4j browser or the neo4j import tool, or any programming language that is supported by neo4j. To speed up loading and query response times, you could also create proper indexes on your model properties."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "In order to satisfy the assignment requirements, we used *Neo4J Desktop*, creating a graph named *dmh2_base_graph* (ver. 3.5.15). \n",
    "\n",
    "Further configuration options that had to be applied are as follows:\n",
    "\n",
    "- Installation of the *APOC* library (ver. 3.5.0.9)\n",
    "\n",
    "- In neo4j.config, we added / altered the following parameters:\n",
    "\n",
    "    - dbms.memory.heap.initial_size=2G\n",
    "\n",
    "    - dbms.memory.heap.max_size=8G\n",
    "\n",
    "    - apoc.import.file.enabled=true\n",
    "\n",
    "    - apoc.export.file.enabled=true\n",
    "    \n",
    "    - dbms.security.procedures.unrestricted=*\n",
    "    \n",
    "    \n",
    "The following plugin package needs to be downloaded and installed: https://s3-eu-west-1.amazonaws.com/com.neo4j.graphalgorithms.dist/neo4j-graph-algorithms-3.5.14.0-standalone.zip. The .jar file should be extracted in the \"*plugins*\" directory of the Neo4J installation. This prevents the message \"*There is no procedure with the name `...` registered for this database instance. Please ensure you've spelled the procedure name correctly and that the procedure is properly deployed.*\" from occuring."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "In order to be able to load JSON files into the graph, we copied the source files \n",
    "- \n",
    "\n",
    "in the Neo4J import directory."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "This part of the assignment provides an alternative implementation to querying a *Neo4J* through the Python interface."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Load required libraries"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "import logging\n",
    "import sys\n",
    "import pandas as pd\n",
    "\n",
    "sys.path.append(\"code/\")\n",
    "\n",
    "from DMH2 import Neo4jPy"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "logging.basicConfig(\n",
    "    format = \"%(levelname)s: %(message)s\", \n",
    "    level = logging.INFO, \n",
    "    datefmt = \"%I:%M:%S\"\n",
    ")\n",
    "log = logging.getLogger()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<module 'DMH2.Neo4jPy' from 'code/DMH2/Neo4jPy.py'>"
      ]
     },
     "execution_count": 3,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "import importlib\n",
    "importlib.reload(Neo4jPy)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Connect"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Create a Neo4JPy object.\n",
    "neo4jpy = Neo4jPy.Neo4jPy(\n",
    "    uri = \"bolt://localhost:7687/\",\n",
    "    user = \"neo4j\", \n",
    "    password = \"dmh2\"\n",
    ")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Drop all objects\n",
    "\n",
    "- remove all nodes and connections\n",
    "- remove all indexes and constraints"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [],
   "source": [
    "neo4jpy.execute_statement(\"CALL apoc.periodic.iterate(\\\"MATCH (n) RETURN n\\\",\\\"DETACH DELETE n\\\", {batchSize:10000, parallel:false})\")\n",
    "neo4jpy.execute_statement(\"CALL apoc.schema.assert({}, {})\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "neo4jpy.query(\"MATCH (n) RETURN n\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Ingest JSON data"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Creating unique indexes"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "First of all we create the following 3 unique constraints which will help us\n",
    "- Create a solid without duplicate node\n",
    "- Load the json data much more quickly since our importing can use these indexes to verify existing nodes and update them"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Create constraints.\n",
    "neo4jpy.execute_statement(\"CREATE CONSTRAINT ON (author:Author) ASSERT author.name IS UNIQUE\")\n",
    "neo4jpy.execute_statement(\"CREATE CONSTRAINT ON (venue:Venue) ASSERT venue.name IS UNIQUE\")\n",
    "neo4jpy.execute_statement(\"CREATE CONSTRAINT ON (article:Article) ASSERT article.id IS UNIQUE\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Import Data"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Then we will import json data, Some remarks are\n",
    "\n",
    "- 1) While injesting articles we also create the references with the id, but they will not have title, year and abstract\n",
    "- 2) After the article with an id is in our sample we update the incomplete article with the other information.\n",
    "- 3) Because there are more referenced ids than the articles that we have on the dataset, in the end it will be common to \n",
    "   encounter articles with only id assigned."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Ingest source JSON data.\n",
    "neo4jpy.execute_statement(\"\"\"\n",
    "    CALL apoc.periodic.iterate(\n",
    "        'UNWIND [\"dblp-ref-0.json\", \"dblp-ref-1.json\", \"dblp-ref-2.json\", \"dblp-ref-3.json\"] AS file CALL apoc.load.json(file) YIELD value as a return a',\n",
    "        'MERGE (article:Article {id: a.id}) \n",
    "            ON CREATE SET article.title = a.title, article.year = a.year, article.abstract = a.abstract\n",
    "            ON MATCH SET article.title = a.title, article.year = a.year, article.abstract = a.abstract\n",
    "        FOREACH (authorName in a.authors | \n",
    "            MERGE (author:Author {name: authorName}) \n",
    "            MERGE (author)-[:WROTE {year: article.year}]->(article)) \n",
    "            MERGE (venue:Venue {name: a.venue }) \n",
    "            MERGE (venue)-[:PRESENTED]->(article)\n",
    "        FOREACH (referenceId in a.references | MERGE (referenceArticle:Article {id: referenceId}) MERGE (article)-[:CITES]->(referenceArticle))',\n",
    "        {batchSize:100}\n",
    "        )\n",
    "    YIELD batches,total return batches, total\n",
    "\"\"\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "The expected number on our graph should be\n",
    "\n",
    "- 184313 articles\n",
    "- 80299 authors\n",
    "- 4 venues\n",
    "- 289908 citation"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Validation"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "No of articles:  184313\n",
      "No of authors:  80299\n",
      "No of venues:  4\n",
      "No of citations:  289908\n"
     ]
    }
   ],
   "source": [
    "print(\"No of articles: \", neo4jpy.query(\"MATCH(n:Article) return count(n)\")[0].value())\n",
    "print(\"No of authors: \", neo4jpy.query(\"MATCH(n:Author) return count(n)\")[0].value())\n",
    "print(\"No of venues: \", neo4jpy.query(\"MATCH(n:Venue) return count(n)\")[0].value())\n",
    "print(\"No of citations: \", neo4jpy.query(\"MATCH ()-[r:CITES]->() RETURN count(*) as count\")[0].value())"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Showing the graph schema"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "In Neo4J Browser, execute *CALL db.schema()*"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "![title](images/schema_base.png)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Our main graphs constists of 3 node types and 3 relations.\n",
    "\n",
    "Nodes\n",
    "\n",
    "- **Author**: The author of an article\n",
    "    - **name** unique mandatory\n",
    "\n",
    "\n",
    "- **Article**: An article\n",
    "    - **id**: unique mandatory\n",
    "    - **title**: optional\n",
    "    - **year**: optional\n",
    "    - **abstract**: optional\n",
    "\n",
    "\n",
    "- **Venue**: A venue, event\n",
    "    - **name**: unique mandatory\n",
    "    \n",
    "\n",
    "Relations\n",
    "\n",
    "- **WROTE**: a directed edge from an author to the articles that he has written\n",
    "    - **year**: unique mandatory\n",
    "- **CITES**: a directed edge from an article to the articles that it has referenced\n",
    "- **PRESENTED**: a directed adge from a value to the article that is has presented"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Querying the database"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### 1) Which are the top 5 authors with the most citations. Return author name and number of citations."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>author</th>\n",
       "      <th>citations</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Roman Słowiński</td>\n",
       "      <td>251</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Zdzisław Pawlak</td>\n",
       "      <td>240</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Jerzy W. Grzymala-Busse</td>\n",
       "      <td>233</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Nenad Medvidovic</td>\n",
       "      <td>216</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Wojciech Ziarko</td>\n",
       "      <td>214</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                    author citations\n",
       "0          Roman Słowiński       251\n",
       "1          Zdzisław Pawlak       240\n",
       "2  Jerzy W. Grzymala-Busse       233\n",
       "3         Nenad Medvidovic       216\n",
       "4          Wojciech Ziarko       214"
      ]
     },
     "execution_count": 10,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "neo4jpy.to_df(\n",
    "    neo4jpy.query(\"\"\"\n",
    "        MATCH (x:Author) - [w:WROTE] -> (n:Article) <- [c:CITES] - (a:Article)\n",
    "        RETURN x AS author, COUNT(c) AS citations\n",
    "        ORDER BY citations DESC\n",
    "        LIMIT 5\n",
    "    \"\"\")\n",
    ")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### 2) Which are the top 5 authors with the most collaborations (with different authors). Return author name and number of collaborations."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>author</th>\n",
       "      <th>collaborators_count</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Barry W. Boehm</td>\n",
       "      <td>84</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Bart Preneel</td>\n",
       "      <td>83</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Marco Dorigo</td>\n",
       "      <td>79</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Schahram Dustdar</td>\n",
       "      <td>75</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Josef Kittler</td>\n",
       "      <td>70</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "             author collaborators_count\n",
       "0    Barry W. Boehm                  84\n",
       "1      Bart Preneel                  83\n",
       "2      Marco Dorigo                  79\n",
       "3  Schahram Dustdar                  75\n",
       "4     Josef Kittler                  70"
      ]
     },
     "execution_count": 11,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "neo4jpy.to_df(\n",
    "    neo4jpy.query(\"\"\"\n",
    "        MATCH (x:Author) - [w:WROTE] -> (n:Article) <- [c:WROTE] - (b:Author)\n",
    "        RETURN x AS author, COUNT(DISTINCT b) AS collaborators_count\n",
    "        ORDER BY collaborators_count DESC\n",
    "        LIMIT 5 \n",
    "    \"\"\")\n",
    ")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### 3) Which is the author who has wrote the most papers without collaborations. Return author name and number of papers."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>author</th>\n",
       "      <th>articles_count</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Neil Savage</td>\n",
       "      <td>32</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>David Roman</td>\n",
       "      <td>31</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Leah Hoffmann</td>\n",
       "      <td>29</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Diane Crawford</td>\n",
       "      <td>22</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>John R. Herndon</td>\n",
       "      <td>16</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "            author articles_count\n",
       "0      Neil Savage             32\n",
       "1      David Roman             31\n",
       "2    Leah Hoffmann             29\n",
       "3   Diane Crawford             22\n",
       "4  John R. Herndon             16"
      ]
     },
     "execution_count": 12,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "neo4jpy.to_df(\n",
    "    neo4jpy.query(\"\"\"\n",
    "        MATCH (author:Author) - [w:WROTE] -> (article:Article)\n",
    "        OPTIONAL MATCH (collaborator:Author) - [w1:WROTE] -> (article:Article)\n",
    "        WITH author, COUNT(article) AS articles_count, COUNT(DISTINCT collaborator) AS collaborators_count\n",
    "        WHERE collaborators_count = 1\n",
    "        RETURN author, articles_count\n",
    "        ORDER BY articles_count DESC\n",
    "        LIMIT 5\n",
    "    \"\"\")\n",
    ")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### 4) Which author published the most papers in 2003? Return author name and number of papers."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>author</th>\n",
       "      <th>articles</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Bernard De Baets</td>\n",
       "      <td>9</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Horst Bunke</td>\n",
       "      <td>7</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Josef Kittler</td>\n",
       "      <td>7</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Jan Bosch</td>\n",
       "      <td>6</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Keng Siau</td>\n",
       "      <td>5</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "             author articles\n",
       "0  Bernard De Baets        9\n",
       "1       Horst Bunke        7\n",
       "2     Josef Kittler        7\n",
       "3         Jan Bosch        6\n",
       "4         Keng Siau        5"
      ]
     },
     "execution_count": 13,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "neo4jpy.to_df(\n",
    "    neo4jpy.query(\"\"\"\n",
    "        MATCH(article:Article {year:2003}) <- [:WROTE] - (author:Author)\n",
    "        RETURN author, count(article) AS articles\n",
    "        ORDER BY articles DESC\n",
    "        LIMIT 5\n",
    "    \"\"\")\n",
    ")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### 5) Which is the venue with the most papers on the Data Mining field (derived from the paper title) in 2001. Return venue and number of papers."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "First of all we will create full text index on the title of the article\n",
    "which will allow us search for the existence of a key phrase in all the titles much more quickly with the benefit of\n",
    "searching for permutations of the phrase"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {},
   "outputs": [],
   "source": [
    "neo4jpy.execute_statement(\"\"\"\n",
    "    call db.index.fulltext.createNodeIndex(\"articleTitle\", [\"Article\"], [\"title\"])\n",
    "\"\"\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>venue</th>\n",
       "      <th>articles</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Lecture Notes in Computer Science</td>\n",
       "      <td>87</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                               venue articles\n",
       "0  Lecture Notes in Computer Science       87"
      ]
     },
     "execution_count": 15,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "neo4jpy.to_df(\n",
    "    neo4jpy.query(\"\"\"\n",
    "        CALL db.index.fulltext.queryNodes(\"articleTitle\", \"Data Mining\")\n",
    "        YIELD node AS article\n",
    "        MATCH (venue:Venue) - [:PRESENTED] -> (article)\n",
    "        WHERE article.year = 2001\n",
    "        RETURN venue, COUNT(article) AS articles\n",
    "        ORDER BY articles DESC\n",
    "        LIMIT 1\n",
    "    \"\"\")\n",
    ")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### 6) Which are the top 5 papers with the most citations? Return paper title and number of citations."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>cited_article_title</th>\n",
       "      <th>number_of_citations</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>None</td>\n",
       "      <td>261202</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Rough sets</td>\n",
       "      <td>211</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>A method for obtaining digital signatures and ...</td>\n",
       "      <td>125</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Pastry: Scalable, Decentralized Object Locatio...</td>\n",
       "      <td>108</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>An axiomatic basis for computer programming</td>\n",
       "      <td>93</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                 cited_article_title number_of_citations\n",
       "0                                               None              261202\n",
       "1                                         Rough sets                 211\n",
       "2  A method for obtaining digital signatures and ...                 125\n",
       "3  Pastry: Scalable, Decentralized Object Locatio...                 108\n",
       "4        An axiomatic basis for computer programming                  93"
      ]
     },
     "execution_count": 16,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "neo4jpy.to_df(\n",
    "    neo4jpy.query(\"\"\"\n",
    "        MATCH (article:Article)-[c:CITES]->(citedArticle:Article)\n",
    "        RETURN citedArticle.title AS cited_article_title, COUNT(c) AS number_of_citations\n",
    "        ORDER BY number_of_citations DESC\n",
    "        LIMIT 5\n",
    "    \"\"\")\n",
    ")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### 7) Which were the papers that use “Neural Networks” in “speech recognition”. Return authors, title and abstract."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {},
   "outputs": [],
   "source": [
    "neo4jpy.execute_statement(\"\"\"\n",
    "    CALL db.index.fulltext.createNodeIndex(\"articleTitleAbstract\", [\"Article\"], [\"title\", \"abstract\"])\n",
    "\"\"\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>article_title</th>\n",
       "      <th>article_abstract</th>\n",
       "      <th>author_name</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Automatic speech recognition with deep neural ...</td>\n",
       "      <td>Automatic Speech Recognition has reached almos...</td>\n",
       "      <td>José A. R. Fonollosa</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Automatic speech recognition with deep neural ...</td>\n",
       "      <td>Automatic Speech Recognition has reached almos...</td>\n",
       "      <td>Cristina España-Bonet</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Implementation of Tamil Speech Recognition Sys...</td>\n",
       "      <td>This paper presents a neural network approach ...</td>\n",
       "      <td>T. V. Geetha</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Implementation of Tamil Speech Recognition Sys...</td>\n",
       "      <td>This paper presents a neural network approach ...</td>\n",
       "      <td>S. Saraswathi</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Speech recognition by integrating audio, visua...</td>\n",
       "      <td>Recent researches have been focusing on fusion...</td>\n",
       "      <td>Joung Woo Ryu</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                       article_title  \\\n",
       "0  Automatic speech recognition with deep neural ...   \n",
       "1  Automatic speech recognition with deep neural ...   \n",
       "2  Implementation of Tamil Speech Recognition Sys...   \n",
       "3  Implementation of Tamil Speech Recognition Sys...   \n",
       "4  Speech recognition by integrating audio, visua...   \n",
       "\n",
       "                                    article_abstract            author_name  \n",
       "0  Automatic Speech Recognition has reached almos...   José A. R. Fonollosa  \n",
       "1  Automatic Speech Recognition has reached almos...  Cristina España-Bonet  \n",
       "2  This paper presents a neural network approach ...           T. V. Geetha  \n",
       "3  This paper presents a neural network approach ...          S. Saraswathi  \n",
       "4  Recent researches have been focusing on fusion...          Joung Woo Ryu  "
      ]
     },
     "execution_count": 18,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "neo4jpy.to_df(\n",
    "    neo4jpy.query(\"\"\"\n",
    "        CALL db.index.fulltext.queryNodes(\"articleTitleAbstract\", \"Neural Networks speech recognition\")\n",
    "        YIELD node AS article\n",
    "        MATCH (author:Author)-[:WROTE]->(article)\n",
    "        RETURN article.title AS article_title, article.abstract AS article_abstract, author.name AS author_name\n",
    "        LIMIT 5\n",
    "    \"\"\")\n",
    ")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Part 2 - Link prediction"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "For this assignment you will also use the created neo4j graph database in order to predict future collaborations between authors. For this task you will use link prediction algorithms as discussed in lecture \"Link Prediction\". Neo4j implements the following algorithms that you can use and test for this task.\n",
    "\n",
    "- Adamic Adar ( algo.linkprediction.adamicAdar )\n",
    "\n",
    "- Common Neighbors ( algo.linkprediction.commonNeighbors )\n",
    "\n",
    "- Preferential Attachment ( algo.linkprediction.preferentialAttachment )\n",
    "\n",
    "- Resource Allocation ( algo.linkprediction.resourceAllocation )\n",
    "\n",
    "- Same Community ( algo.linkprediction.sameCommunity )\n",
    "\n",
    "- Total Neighbors ( algo.linkprediction.totalNeighbors )\n",
    "\n",
    "Before running the algorithms, you should create links between authors that have already collaborated. In order to form a training set, you should add an undirected \"CoAuthor\" relationship between authors that have collaborated until the end of 2005. These relations form the train set and the rest of the collaborations (year > 2005) form the test set with which you will evaluate the accuracy of the link prediction algorithms.\n",
    "\n",
    "After inserting the CoAuthor relations, you should run in neo4j link prediction algorithms using **only the subgraph with \"Author\" nodes and \"Coauthor\" relations**. In order to calculate scores for a given author node you should exclude all nodes that this node is already connected to and calculate scores to all other author nodes of the graph. The nodes that take positive scores are potential coauthors (after 2005) with the specific author.\n",
    "\n",
    "For all the following Authors and for each used algorithm calculate using cypher the following:\n",
    "\n",
    "(a) Compute for each author the number of True Positives (TP), True Negatives (TN), False Positives (FP) and False Negatives (FN) predicted links.\n",
    "\n",
    "(b) Calculate Accuracy, Precision and Recall metrics for each author. \n",
    "\n",
    "(c) Also calculate the adoption rate of each algorithms using the following formula\n",
    "\n",
    "$$\\text{AdoptionRate} = \\frac{\\sum{\\text{score(TP)}}}{\\sum{\\text{score(TP)} + \\sum{\\text{score(FP)}}}}$$\n",
    "\n",
    "Where: \n",
    "\n",
    "TP = links with score > 0 that have been adopted after 2005\n",
    "\n",
    "FP = links with score>0 that have not been adopted after 2005\n",
    "\n",
    "TN = links with score=0 that have not been adopted after 2005\n",
    "\n",
    "FN = links with score=0 that have been adopted after 2005"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Creating required subgraphs"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "To use the prediction algorithms we require a train set which will be used in order to predict future relations.\n",
    "For this purpose will create `:COAUTHOR_TRAIN` relationship between authors that have authored an article before `2005`"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "metadata": {},
   "outputs": [],
   "source": [
    "neo4jpy.execute_statement(\"\"\"\n",
    "    MATCH (:Author) - [r:COAUTHOR_TRAIN] - (:Author)\n",
    "    DELETE r\n",
    "\"\"\")\n",
    "\n",
    "neo4jpy.execute_statement(\"\"\"\n",
    "    MATCH (:Author) - [r:COAUTHOR_TEST] - (:Author)\n",
    "    DELETE r\n",
    "\"\"\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "metadata": {},
   "outputs": [],
   "source": [
    "neo4jpy.execute_statement(\"\"\"\n",
    "    MATCH (author) - [:WROTE] -> (article:Article) <- [:WROTE] - (coauthor:Author)\n",
    "    WHERE article.year <= 2005\n",
    "    MERGE (author) - [:COAUTHOR_TRAIN] - (coauthor)\n",
    "\"\"\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Moreover we will require a test set to validate our predictions. So again we will create a relation between the authors that we know that they have released an article after 2005 and do not already have a relation before 2005"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "metadata": {},
   "outputs": [],
   "source": [
    "neo4jpy.execute_statement(\"\"\"\n",
    "    MATCH (author) - [:WROTE] -> (article:Article) <- [:WROTE] - (coauthor:Author)\n",
    "    WHERE article.year > 2005 AND NOT (author)-[:COAUTHOR_TRAIN] - (coauthor)\n",
    "    MERGE (author) - [:COAUTHOR_TEST] - (coauthor)\n",
    "\"\"\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Showing the graph schema"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "![title](images/schema_link_prediction.png)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Description"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "The same procedure has been applied to each of the algorithms\n",
    "\n",
    "For each of the requested authors\n",
    "\n",
    "- 1) We MATCH all the nodes `:Author` that do not have a `:COAUTHOR_TRAIN` relation with the requested\n",
    "- 2) we optionally MATCH a `:CAUTHOR_TEST` relation between these nodes and the requested\n",
    "\n",
    "---\n",
    "\n",
    "- 3) We predict the score using any algorithm between the requested and all the other nodes.\n",
    "- 4) We count the test relations (expected values are **0** if nodes are not connected after 2005, **1** if nodes are connected after 2005)\n",
    "- 5) Based on the score and the existance of the test relation we can conclude if the prediction is TP, FP, TN, FN\n",
    "---\n",
    "- 6) We canculate\n",
    "   - The sum of TP relations as the total TP of the algorithm (for recall, presision and accuracy)\n",
    "   - The sum of FP relations as the total FP of the algorithm (for recall, presision and accuracy)\n",
    "   - The sum of TN relations as the total TN of the algorithm (for recall, presision and accuracy)\n",
    "   - The sum of FN relations as the total FN of the algorithm (for recall, presision and accuracy)\n",
    "   \n",
    "   - The sum score of TP relations as the total score(TP) of the algorithm (for AdoptionRate)\n",
    "   - The sum score of FP relations as the total score(FP) of the algorithm (for AdoptionRate)\n",
    "   \n",
    "- 7) Using all the above metrics in the final step we calculate the (recall, presision, accuracy, adoption rate) for each user\n",
    "   "
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Adamic Adar algorithm Scores"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "The Adamic Adar algorithm was introduced in 2003 by Lada Adamic and Eytan Adar to predict links in a social network. It is computed using the following formula:\n",
    "\n",
    "$A(x, y)=\\sum_{u \\in N(x) \\cap N(y)} \\frac{1}{\\log |N(u)|}$\n",
    "\n",
    "where N(u) is the set of nodes adjacent to u.\n",
    "\n",
    "A value of 0 indicates that two nodes are not close, while higher values indicate nodes are closer."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>author</th>\n",
       "      <th>TP</th>\n",
       "      <th>FP</th>\n",
       "      <th>TN</th>\n",
       "      <th>FN</th>\n",
       "      <th>TP_score</th>\n",
       "      <th>FP_score</th>\n",
       "      <th>Recall</th>\n",
       "      <th>Presision</th>\n",
       "      <th>Accuracy</th>\n",
       "      <th>AdoptionRate</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Krzysztof Kaczmarski</td>\n",
       "      <td>4</td>\n",
       "      <td>10</td>\n",
       "      <td>80284</td>\n",
       "      <td>1</td>\n",
       "      <td>2.1176</td>\n",
       "      <td>7.83675</td>\n",
       "      <td>0.8</td>\n",
       "      <td>0.285714</td>\n",
       "      <td>0.999863</td>\n",
       "      <td>0.212731</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Hector Garcia-Molina</td>\n",
       "      <td>9</td>\n",
       "      <td>29</td>\n",
       "      <td>80242</td>\n",
       "      <td>19</td>\n",
       "      <td>2.574</td>\n",
       "      <td>16.3452</td>\n",
       "      <td>0.321429</td>\n",
       "      <td>0.236842</td>\n",
       "      <td>0.999402</td>\n",
       "      <td>0.136052</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Christine Parent</td>\n",
       "      <td>6</td>\n",
       "      <td>22</td>\n",
       "      <td>80263</td>\n",
       "      <td>8</td>\n",
       "      <td>1.78185</td>\n",
       "      <td>6.53343</td>\n",
       "      <td>0.428571</td>\n",
       "      <td>0.214286</td>\n",
       "      <td>0.999626</td>\n",
       "      <td>0.214286</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Robert Meersman</td>\n",
       "      <td>9</td>\n",
       "      <td>54</td>\n",
       "      <td>80223</td>\n",
       "      <td>13</td>\n",
       "      <td>5.07593</td>\n",
       "      <td>46.2501</td>\n",
       "      <td>0.409091</td>\n",
       "      <td>0.142857</td>\n",
       "      <td>0.999166</td>\n",
       "      <td>0.0988958</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Pier Luigi Emiliani</td>\n",
       "      <td>3</td>\n",
       "      <td>3</td>\n",
       "      <td>80293</td>\n",
       "      <td>0</td>\n",
       "      <td>1.67433</td>\n",
       "      <td>2.55892</td>\n",
       "      <td>1</td>\n",
       "      <td>0.5</td>\n",
       "      <td>0.999963</td>\n",
       "      <td>0.395519</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Hidenao Abe</td>\n",
       "      <td>2</td>\n",
       "      <td>5</td>\n",
       "      <td>80291</td>\n",
       "      <td>1</td>\n",
       "      <td>1.0278</td>\n",
       "      <td>8.54772</td>\n",
       "      <td>0.666667</td>\n",
       "      <td>0.285714</td>\n",
       "      <td>0.999925</td>\n",
       "      <td>0.107336</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Mario Lamberger</td>\n",
       "      <td>2</td>\n",
       "      <td>4</td>\n",
       "      <td>80288</td>\n",
       "      <td>5</td>\n",
       "      <td>1.82048</td>\n",
       "      <td>4.70587</td>\n",
       "      <td>0.285714</td>\n",
       "      <td>0.333333</td>\n",
       "      <td>0.999888</td>\n",
       "      <td>0.278943</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>Kaoru Inoue</td>\n",
       "      <td>3</td>\n",
       "      <td>7</td>\n",
       "      <td>80285</td>\n",
       "      <td>4</td>\n",
       "      <td>3.90865</td>\n",
       "      <td>9.98134</td>\n",
       "      <td>0.428571</td>\n",
       "      <td>0.3</td>\n",
       "      <td>0.999863</td>\n",
       "      <td>0.2814</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>Gabriel Thierrin</td>\n",
       "      <td>2</td>\n",
       "      <td>4</td>\n",
       "      <td>80292</td>\n",
       "      <td>1</td>\n",
       "      <td>1.11622</td>\n",
       "      <td>3.11703</td>\n",
       "      <td>0.666667</td>\n",
       "      <td>0.333333</td>\n",
       "      <td>0.999938</td>\n",
       "      <td>0.26368</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>Marcin Gogolewski</td>\n",
       "      <td>2</td>\n",
       "      <td>5</td>\n",
       "      <td>80291</td>\n",
       "      <td>1</td>\n",
       "      <td>2.27047</td>\n",
       "      <td>3.29826</td>\n",
       "      <td>0.666667</td>\n",
       "      <td>0.285714</td>\n",
       "      <td>0.999925</td>\n",
       "      <td>0.407717</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                 author TP  FP     TN  FN TP_score FP_score    Recall  \\\n",
       "0  Krzysztof Kaczmarski  4  10  80284   1   2.1176  7.83675       0.8   \n",
       "1  Hector Garcia-Molina  9  29  80242  19    2.574  16.3452  0.321429   \n",
       "2      Christine Parent  6  22  80263   8  1.78185  6.53343  0.428571   \n",
       "3       Robert Meersman  9  54  80223  13  5.07593  46.2501  0.409091   \n",
       "4   Pier Luigi Emiliani  3   3  80293   0  1.67433  2.55892         1   \n",
       "5           Hidenao Abe  2   5  80291   1   1.0278  8.54772  0.666667   \n",
       "6       Mario Lamberger  2   4  80288   5  1.82048  4.70587  0.285714   \n",
       "7           Kaoru Inoue  3   7  80285   4  3.90865  9.98134  0.428571   \n",
       "8      Gabriel Thierrin  2   4  80292   1  1.11622  3.11703  0.666667   \n",
       "9     Marcin Gogolewski  2   5  80291   1  2.27047  3.29826  0.666667   \n",
       "\n",
       "  Presision  Accuracy AdoptionRate  \n",
       "0  0.285714  0.999863     0.212731  \n",
       "1  0.236842  0.999402     0.136052  \n",
       "2  0.214286  0.999626     0.214286  \n",
       "3  0.142857  0.999166    0.0988958  \n",
       "4       0.5  0.999963     0.395519  \n",
       "5  0.285714  0.999925     0.107336  \n",
       "6  0.333333  0.999888     0.278943  \n",
       "7       0.3  0.999863       0.2814  \n",
       "8  0.333333  0.999938      0.26368  \n",
       "9  0.285714  0.999925     0.407717  "
      ]
     },
     "execution_count": 22,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "neo4jpy.to_df(\n",
    "    neo4jpy.query(\"\"\"\n",
    "        WITH [\n",
    "            \"Krzysztof Kaczmarski\", \n",
    "            \"Hector Garcia-Molina\", \n",
    "            \"Christine Parent\", \n",
    "            \"Robert Meersman\", \n",
    "            \"Pier Luigi Emiliani\", \n",
    "            \"Hidenao Abe\", \n",
    "            \"Mario Lamberger\", \n",
    "            \"Kaoru Inoue\", \n",
    "            \"Gabriel Thierrin\", \n",
    "            \"Marcin Gogolewski\"\n",
    "        ] AS author_names\n",
    "        UNWIND author_names AS author_name\n",
    "        MATCH (other:Author)\n",
    "        MATCH (author:Author {name: author_name})\n",
    "        OPTIONAL MATCH (author:Author) - [r:COAUTHOR_TEST] - (other:Author)\n",
    "        WHERE not (author) - [:COAUTHOR_TRAIN] - (other)\n",
    "        WITH \n",
    "            author AS author, \n",
    "            other AS coauthor,\n",
    "            algo.linkprediction.adamicAdar(author, other, { relationshipQuery: \"COAUTHOR_TRAIN\", direction: \"BOTH\" }) AS score,\n",
    "            COUNT(r) AS in_test\n",
    "        WITH \n",
    "            author,\n",
    "            coauthor,\n",
    "            score,\n",
    "            in_test,\n",
    "            CASE WHEN score > 0 AND in_test = 1 THEN 1 ELSE 0 END AS TP,\n",
    "            CASE WHEN score > 0 AND in_test = 1 THEN score ELSE 0 END AS TP_score,\n",
    "            CASE WHEN score > 0 AND in_test = 0 THEN 1 ELSE 0 END AS FP,\n",
    "            CASE WHEN score > 0 AND in_test = 0 THEN score ELSE 0 END AS FP_score,\n",
    "            CASE WHEN score = 0 AND in_test = 0 THEN 1 ELSE 0 END AS TN,\n",
    "            CASE WHEN score = 0 AND in_test = 1 THEN 1 ELSE 0 END AS FN\n",
    "        WITH \n",
    "            DISTINCT(author) AS author,\n",
    "            SUM(TP) AS TP,\n",
    "            SUM(TP_score) AS TP_score,\n",
    "            SUM(FP) AS FP,\n",
    "            SUM(FP_score) AS FP_score,\n",
    "            SUM(TN) AS TN,\n",
    "            SUM(FN) AS FN\n",
    "        RETURN\n",
    "            author.name AS author,\n",
    "            TP, FP, TN, FN,\n",
    "            TP_score, FP_score,\n",
    "            toFloat(TP) / ( TP + FN ) AS Recall,\n",
    "            toFloat(TP) / ( TP + FP) AS Presision,\n",
    "            toFloat(TP + TN ) / (TP + FP + FN + TN) AS Accuracy,\n",
    "            toFloat(TP_score) / (TP_score + FP_score) AS AdoptionRate\n",
    "    \"\"\"\n",
    "    )\n",
    ")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Common Neighbors algorithm Scores"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "It is computed using the following formula:\n",
    "\n",
    "$C N(x, y)=|N(x) \\cap N(y)|$\n",
    "\n",
    "where $N(x)$ is the set of nodes adjacent to node $x$, and $N(y)$ is the set of nodes adjacent to node $y$.\n",
    "\n",
    "A value of 0 indicates that two nodes are not close, while higher values indicate nodes are closer."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>author</th>\n",
       "      <th>TP</th>\n",
       "      <th>FP</th>\n",
       "      <th>TN</th>\n",
       "      <th>FN</th>\n",
       "      <th>TP_score</th>\n",
       "      <th>FP_score</th>\n",
       "      <th>Recall</th>\n",
       "      <th>Presision</th>\n",
       "      <th>Accuracy</th>\n",
       "      <th>AdoptionRate</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Krzysztof Kaczmarski</td>\n",
       "      <td>4</td>\n",
       "      <td>10</td>\n",
       "      <td>80284</td>\n",
       "      <td>1</td>\n",
       "      <td>5</td>\n",
       "      <td>16</td>\n",
       "      <td>0.8</td>\n",
       "      <td>0.285714</td>\n",
       "      <td>0.999863</td>\n",
       "      <td>0.238095</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Hector Garcia-Molina</td>\n",
       "      <td>9</td>\n",
       "      <td>29</td>\n",
       "      <td>80242</td>\n",
       "      <td>19</td>\n",
       "      <td>9</td>\n",
       "      <td>35</td>\n",
       "      <td>0.321429</td>\n",
       "      <td>0.236842</td>\n",
       "      <td>0.999402</td>\n",
       "      <td>0.204545</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Christine Parent</td>\n",
       "      <td>6</td>\n",
       "      <td>22</td>\n",
       "      <td>80263</td>\n",
       "      <td>8</td>\n",
       "      <td>6</td>\n",
       "      <td>22</td>\n",
       "      <td>0.428571</td>\n",
       "      <td>0.214286</td>\n",
       "      <td>0.999626</td>\n",
       "      <td>0.214286</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Robert Meersman</td>\n",
       "      <td>9</td>\n",
       "      <td>54</td>\n",
       "      <td>80223</td>\n",
       "      <td>13</td>\n",
       "      <td>16</td>\n",
       "      <td>113</td>\n",
       "      <td>0.409091</td>\n",
       "      <td>0.142857</td>\n",
       "      <td>0.999166</td>\n",
       "      <td>0.124031</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Pier Luigi Emiliani</td>\n",
       "      <td>3</td>\n",
       "      <td>3</td>\n",
       "      <td>80293</td>\n",
       "      <td>0</td>\n",
       "      <td>3</td>\n",
       "      <td>3</td>\n",
       "      <td>1</td>\n",
       "      <td>0.5</td>\n",
       "      <td>0.999963</td>\n",
       "      <td>0.5</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Hidenao Abe</td>\n",
       "      <td>2</td>\n",
       "      <td>5</td>\n",
       "      <td>80291</td>\n",
       "      <td>1</td>\n",
       "      <td>2</td>\n",
       "      <td>13</td>\n",
       "      <td>0.666667</td>\n",
       "      <td>0.285714</td>\n",
       "      <td>0.999925</td>\n",
       "      <td>0.133333</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Mario Lamberger</td>\n",
       "      <td>2</td>\n",
       "      <td>4</td>\n",
       "      <td>80288</td>\n",
       "      <td>5</td>\n",
       "      <td>2</td>\n",
       "      <td>4</td>\n",
       "      <td>0.285714</td>\n",
       "      <td>0.333333</td>\n",
       "      <td>0.999888</td>\n",
       "      <td>0.333333</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>Kaoru Inoue</td>\n",
       "      <td>3</td>\n",
       "      <td>7</td>\n",
       "      <td>80285</td>\n",
       "      <td>4</td>\n",
       "      <td>9</td>\n",
       "      <td>21</td>\n",
       "      <td>0.428571</td>\n",
       "      <td>0.3</td>\n",
       "      <td>0.999863</td>\n",
       "      <td>0.3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>Gabriel Thierrin</td>\n",
       "      <td>2</td>\n",
       "      <td>4</td>\n",
       "      <td>80292</td>\n",
       "      <td>1</td>\n",
       "      <td>2</td>\n",
       "      <td>4</td>\n",
       "      <td>0.666667</td>\n",
       "      <td>0.333333</td>\n",
       "      <td>0.999938</td>\n",
       "      <td>0.333333</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>Marcin Gogolewski</td>\n",
       "      <td>2</td>\n",
       "      <td>5</td>\n",
       "      <td>80291</td>\n",
       "      <td>1</td>\n",
       "      <td>4</td>\n",
       "      <td>6</td>\n",
       "      <td>0.666667</td>\n",
       "      <td>0.285714</td>\n",
       "      <td>0.999925</td>\n",
       "      <td>0.4</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                 author TP  FP     TN  FN TP_score FP_score    Recall  \\\n",
       "0  Krzysztof Kaczmarski  4  10  80284   1        5       16       0.8   \n",
       "1  Hector Garcia-Molina  9  29  80242  19        9       35  0.321429   \n",
       "2      Christine Parent  6  22  80263   8        6       22  0.428571   \n",
       "3       Robert Meersman  9  54  80223  13       16      113  0.409091   \n",
       "4   Pier Luigi Emiliani  3   3  80293   0        3        3         1   \n",
       "5           Hidenao Abe  2   5  80291   1        2       13  0.666667   \n",
       "6       Mario Lamberger  2   4  80288   5        2        4  0.285714   \n",
       "7           Kaoru Inoue  3   7  80285   4        9       21  0.428571   \n",
       "8      Gabriel Thierrin  2   4  80292   1        2        4  0.666667   \n",
       "9     Marcin Gogolewski  2   5  80291   1        4        6  0.666667   \n",
       "\n",
       "  Presision  Accuracy AdoptionRate  \n",
       "0  0.285714  0.999863     0.238095  \n",
       "1  0.236842  0.999402     0.204545  \n",
       "2  0.214286  0.999626     0.214286  \n",
       "3  0.142857  0.999166     0.124031  \n",
       "4       0.5  0.999963          0.5  \n",
       "5  0.285714  0.999925     0.133333  \n",
       "6  0.333333  0.999888     0.333333  \n",
       "7       0.3  0.999863          0.3  \n",
       "8  0.333333  0.999938     0.333333  \n",
       "9  0.285714  0.999925          0.4  "
      ]
     },
     "execution_count": 23,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "neo4jpy.to_df(\n",
    "    neo4jpy.query(\"\"\"\n",
    "        WITH [\n",
    "            \"Krzysztof Kaczmarski\", \n",
    "            \"Hector Garcia-Molina\", \n",
    "            \"Christine Parent\", \n",
    "            \"Robert Meersman\", \n",
    "            \"Pier Luigi Emiliani\", \n",
    "            \"Hidenao Abe\", \n",
    "            \"Mario Lamberger\", \n",
    "            \"Kaoru Inoue\", \n",
    "            \"Gabriel Thierrin\", \n",
    "            \"Marcin Gogolewski\"\n",
    "        ] AS author_names\n",
    "        UNWIND author_names AS author_name\n",
    "        MATCH (other:Author)\n",
    "        MATCH (author:Author {name: author_name})\n",
    "        OPTIONAL MATCH (author:Author) - [r:COAUTHOR_TEST] - (other:Author)\n",
    "        WHERE NOT (author) - [:COAUTHOR_TRAIN] - (other)\n",
    "        WITH \n",
    "            author AS author, \n",
    "            other AS coauthor,\n",
    "            algo.linkprediction.commonNeighbors(author, other, { relationshipQuery: \"COAUTHOR_TRAIN\", direction: \"BOTH\" }) AS score,\n",
    "            COUNT(r) AS in_test\n",
    "        WITH \n",
    "            author,\n",
    "            coauthor,\n",
    "            score,\n",
    "            in_test,\n",
    "            CASE WHEN score > 0 AND in_test = 1 THEN 1 ELSE 0 END AS TP,\n",
    "            CASE WHEN score > 0 AND in_test = 1 THEN score ELSE 0 END AS TP_score,\n",
    "            CASE WHEN score > 0 AND in_test = 0 THEN 1 ELSE 0 END AS FP,\n",
    "            CASE WHEN score > 0 AND in_test = 0 THEN score ELSE 0 END AS FP_score,\n",
    "            CASE WHEN score = 0 AND in_test = 0 THEN 1 ELSE 0 END AS TN,\n",
    "            CASE WHEN score = 0 AND in_test = 1 THEN 1 ELSE 0 END AS FN\n",
    "        WITH \n",
    "            DISTINCT(author) AS author,\n",
    "            SUM(TP) AS TP,\n",
    "            SUM(TP_score) AS TP_score,\n",
    "            SUM(FP) AS FP,\n",
    "            SUM(FP_score) AS FP_score,\n",
    "            SUM(TN) AS TN,\n",
    "            SUM(FN) AS FN\n",
    "        RETURN\n",
    "            author.name AS author,\n",
    "            TP, FP, TN, FN,\n",
    "            TP_score, FP_score,\n",
    "            toFloat(TP) / ( TP + FN ) AS Recall,\n",
    "            toFloat(TP) / ( TP + FP) AS Presision,\n",
    "            toFloat(TP + TN ) / (TP + FP + FN + TN) AS Accuracy,\n",
    "            toFloat(TP_score) / (TP_score + FP_score) AS AdoptionRate\n",
    "    \"\"\"\n",
    "    )\n",
    ")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Preferential Attachment algorithm Scores"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Preferential attachment means that the more connected a node is, the more likely it is to receive new links. \n",
    "This algorithm was popularised by Albert-Lászli Barabási and Réka Albert through their work on scale-free networks. It is computed\n",
    "using the following formula:\n",
    "\n",
    "$P A(x, y)=|N(x)| *|N(y)|$\n",
    "\n",
    "where $\\mathrm{N}(u)$ is the set of nodes adjacent to $u$.\n",
    "\n",
    "A value of 0 indicates that two nodes are not close, while higher values indicate that nodes are closer."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>author</th>\n",
       "      <th>TP</th>\n",
       "      <th>FP</th>\n",
       "      <th>TN</th>\n",
       "      <th>FN</th>\n",
       "      <th>TP_score</th>\n",
       "      <th>FP_score</th>\n",
       "      <th>Recall</th>\n",
       "      <th>Presision</th>\n",
       "      <th>Accuracy</th>\n",
       "      <th>AdoptionRate</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Krzysztof Kaczmarski</td>\n",
       "      <td>4</td>\n",
       "      <td>45014</td>\n",
       "      <td>35280</td>\n",
       "      <td>1</td>\n",
       "      <td>39</td>\n",
       "      <td>486537</td>\n",
       "      <td>0.8</td>\n",
       "      <td>8.88533e-05</td>\n",
       "      <td>0.439408</td>\n",
       "      <td>8.01519e-05</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Hector Garcia-Molina</td>\n",
       "      <td>17</td>\n",
       "      <td>45001</td>\n",
       "      <td>35270</td>\n",
       "      <td>11</td>\n",
       "      <td>2432</td>\n",
       "      <td>1.2951e+06</td>\n",
       "      <td>0.607143</td>\n",
       "      <td>0.000377627</td>\n",
       "      <td>0.439445</td>\n",
       "      <td>0.00187432</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Christine Parent</td>\n",
       "      <td>13</td>\n",
       "      <td>45005</td>\n",
       "      <td>35280</td>\n",
       "      <td>1</td>\n",
       "      <td>213</td>\n",
       "      <td>161979</td>\n",
       "      <td>0.928571</td>\n",
       "      <td>0.000288773</td>\n",
       "      <td>0.43952</td>\n",
       "      <td>0.00131326</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Robert Meersman</td>\n",
       "      <td>15</td>\n",
       "      <td>45003</td>\n",
       "      <td>35274</td>\n",
       "      <td>7</td>\n",
       "      <td>2870</td>\n",
       "      <td>2.26782e+06</td>\n",
       "      <td>0.681818</td>\n",
       "      <td>0.0003332</td>\n",
       "      <td>0.43947</td>\n",
       "      <td>0.00126393</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Pier Luigi Emiliani</td>\n",
       "      <td>3</td>\n",
       "      <td>45015</td>\n",
       "      <td>35281</td>\n",
       "      <td>0</td>\n",
       "      <td>24</td>\n",
       "      <td>324360</td>\n",
       "      <td>1</td>\n",
       "      <td>6.664e-05</td>\n",
       "      <td>0.439408</td>\n",
       "      <td>7.39864e-05</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Hidenao Abe</td>\n",
       "      <td>3</td>\n",
       "      <td>45015</td>\n",
       "      <td>35281</td>\n",
       "      <td>0</td>\n",
       "      <td>48</td>\n",
       "      <td>648720</td>\n",
       "      <td>1</td>\n",
       "      <td>6.664e-05</td>\n",
       "      <td>0.439408</td>\n",
       "      <td>7.39864e-05</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Mario Lamberger</td>\n",
       "      <td>4</td>\n",
       "      <td>45014</td>\n",
       "      <td>35278</td>\n",
       "      <td>3</td>\n",
       "      <td>116</td>\n",
       "      <td>648652</td>\n",
       "      <td>0.571429</td>\n",
       "      <td>8.88533e-05</td>\n",
       "      <td>0.439383</td>\n",
       "      <td>0.0001788</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>Kaoru Inoue</td>\n",
       "      <td>3</td>\n",
       "      <td>45015</td>\n",
       "      <td>35277</td>\n",
       "      <td>4</td>\n",
       "      <td>96</td>\n",
       "      <td>648672</td>\n",
       "      <td>0.428571</td>\n",
       "      <td>6.664e-05</td>\n",
       "      <td>0.439358</td>\n",
       "      <td>0.000147973</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>Gabriel Thierrin</td>\n",
       "      <td>2</td>\n",
       "      <td>45016</td>\n",
       "      <td>35280</td>\n",
       "      <td>1</td>\n",
       "      <td>12</td>\n",
       "      <td>324372</td>\n",
       "      <td>0.666667</td>\n",
       "      <td>4.44267e-05</td>\n",
       "      <td>0.439383</td>\n",
       "      <td>3.69932e-05</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>Marcin Gogolewski</td>\n",
       "      <td>2</td>\n",
       "      <td>45016</td>\n",
       "      <td>35280</td>\n",
       "      <td>1</td>\n",
       "      <td>12</td>\n",
       "      <td>324372</td>\n",
       "      <td>0.666667</td>\n",
       "      <td>4.44267e-05</td>\n",
       "      <td>0.439383</td>\n",
       "      <td>3.69932e-05</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                 author  TP     FP     TN  FN TP_score     FP_score    Recall  \\\n",
       "0  Krzysztof Kaczmarski   4  45014  35280   1       39       486537       0.8   \n",
       "1  Hector Garcia-Molina  17  45001  35270  11     2432   1.2951e+06  0.607143   \n",
       "2      Christine Parent  13  45005  35280   1      213       161979  0.928571   \n",
       "3       Robert Meersman  15  45003  35274   7     2870  2.26782e+06  0.681818   \n",
       "4   Pier Luigi Emiliani   3  45015  35281   0       24       324360         1   \n",
       "5           Hidenao Abe   3  45015  35281   0       48       648720         1   \n",
       "6       Mario Lamberger   4  45014  35278   3      116       648652  0.571429   \n",
       "7           Kaoru Inoue   3  45015  35277   4       96       648672  0.428571   \n",
       "8      Gabriel Thierrin   2  45016  35280   1       12       324372  0.666667   \n",
       "9     Marcin Gogolewski   2  45016  35280   1       12       324372  0.666667   \n",
       "\n",
       "     Presision  Accuracy AdoptionRate  \n",
       "0  8.88533e-05  0.439408  8.01519e-05  \n",
       "1  0.000377627  0.439445   0.00187432  \n",
       "2  0.000288773   0.43952   0.00131326  \n",
       "3    0.0003332   0.43947   0.00126393  \n",
       "4    6.664e-05  0.439408  7.39864e-05  \n",
       "5    6.664e-05  0.439408  7.39864e-05  \n",
       "6  8.88533e-05  0.439383    0.0001788  \n",
       "7    6.664e-05  0.439358  0.000147973  \n",
       "8  4.44267e-05  0.439383  3.69932e-05  \n",
       "9  4.44267e-05  0.439383  3.69932e-05  "
      ]
     },
     "execution_count": 24,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "neo4jpy.to_df(\n",
    "    neo4jpy.query(\"\"\"\n",
    "        WITH [\n",
    "            \"Krzysztof Kaczmarski\", \n",
    "            \"Hector Garcia-Molina\", \n",
    "            \"Christine Parent\", \n",
    "            \"Robert Meersman\", \n",
    "            \"Pier Luigi Emiliani\", \n",
    "            \"Hidenao Abe\", \n",
    "            \"Mario Lamberger\", \n",
    "            \"Kaoru Inoue\", \n",
    "            \"Gabriel Thierrin\", \n",
    "            \"Marcin Gogolewski\"\n",
    "        ] AS author_names\n",
    "        UNWIND author_names AS author_name\n",
    "        MATCH (other:Author)\n",
    "        MATCH (author:Author {name: author_name})\n",
    "        OPTIONAL MATCH (author:Author) - [r:COAUTHOR_TEST] - (other:Author)\n",
    "        WHERE NOT (author) - [:COAUTHOR_TRAIN] - (other)\n",
    "        WITH \n",
    "            author AS author, \n",
    "            other AS coauthor,\n",
    "            algo.linkprediction.preferentialAttachment(author, other, { relationshipQuery: \"COAUTHOR_TRAIN\", direction: \"BOTH\" }) AS score,\n",
    "            COUNT(r) AS in_test\n",
    "        WITH \n",
    "            author,\n",
    "            coauthor,\n",
    "            score,\n",
    "            in_test,\n",
    "            CASE WHEN score > 0 AND in_test = 1 THEN 1 ELSE 0 END AS TP,\n",
    "            CASE WHEN score > 0 AND in_test = 1 THEN score ELSE 0 END AS TP_score,\n",
    "            CASE WHEN score > 0 AND in_test = 0 THEN 1 ELSE 0 END AS FP,\n",
    "            CASE WHEN score > 0 AND in_test = 0 THEN score ELSE 0 END AS FP_score,\n",
    "            CASE WHEN score = 0 AND in_test = 0 THEN 1 ELSE 0 END AS TN,\n",
    "            CASE WHEN score = 0 AND in_test = 1 THEN 1 ELSE 0 END AS FN\n",
    "        WITH \n",
    "            DISTINCT(author) AS author,\n",
    "            SUM(TP) AS TP,\n",
    "            SUM(TP_score) AS TP_score,\n",
    "            SUM(FP) AS FP,\n",
    "            SUM(FP_score) AS FP_score,\n",
    "            SUM(TN) AS TN,\n",
    "            SUM(FN) AS FN\n",
    "        RETURN\n",
    "            author.name AS author,\n",
    "            TP, FP, TN, FN,\n",
    "            TP_score, FP_score,\n",
    "            toFloat(TP) / ( TP + FN ) AS Recall,\n",
    "            toFloat(TP) / ( TP + FP) AS Presision,\n",
    "            toFloat(TP + TN ) / (TP + FP + FN + TN) AS Accuracy,\n",
    "            toFloat(TP_score) / (TP_score + FP_score) AS AdoptionRate\n",
    "    \"\"\"\n",
    "    )\n",
    ")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Resource Allocation"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "The Resource Allocation algorithm was introduced in 2009 by Tao Zhou, Linyuan Lü, and YI-Cheng Zhang as part of a\n",
    "study to predict links in various networks. It is computed using the following formula:\n",
    "\n",
    "$R A(x, y)=\\sum_{u \\in N(x) \\cap N(y)} \\frac{1}{|N(u)|}$\n",
    "\n",
    "where $N(u)$ is the set of nodes adjacent to $u$.\n",
    "\n",
    "A value of 0 indicates that two nodes are not close, while higher values indicate nodes are closer."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>author</th>\n",
       "      <th>TP</th>\n",
       "      <th>FP</th>\n",
       "      <th>TN</th>\n",
       "      <th>FN</th>\n",
       "      <th>TP_score</th>\n",
       "      <th>FP_score</th>\n",
       "      <th>Recall</th>\n",
       "      <th>Presision</th>\n",
       "      <th>Accuracy</th>\n",
       "      <th>AdoptionRate</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Krzysztof Kaczmarski</td>\n",
       "      <td>4</td>\n",
       "      <td>10</td>\n",
       "      <td>80284</td>\n",
       "      <td>1</td>\n",
       "      <td>0.474359</td>\n",
       "      <td>2.08205</td>\n",
       "      <td>0.8</td>\n",
       "      <td>0.285714</td>\n",
       "      <td>0.999863</td>\n",
       "      <td>0.185557</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Hector Garcia-Molina</td>\n",
       "      <td>9</td>\n",
       "      <td>29</td>\n",
       "      <td>80242</td>\n",
       "      <td>19</td>\n",
       "      <td>0.272727</td>\n",
       "      <td>4.16364</td>\n",
       "      <td>0.321429</td>\n",
       "      <td>0.236842</td>\n",
       "      <td>0.999402</td>\n",
       "      <td>0.0614754</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Christine Parent</td>\n",
       "      <td>6</td>\n",
       "      <td>22</td>\n",
       "      <td>80263</td>\n",
       "      <td>8</td>\n",
       "      <td>0.206897</td>\n",
       "      <td>0.758621</td>\n",
       "      <td>0.428571</td>\n",
       "      <td>0.214286</td>\n",
       "      <td>0.999626</td>\n",
       "      <td>0.214286</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Robert Meersman</td>\n",
       "      <td>9</td>\n",
       "      <td>54</td>\n",
       "      <td>80223</td>\n",
       "      <td>13</td>\n",
       "      <td>0.718313</td>\n",
       "      <td>10.1933</td>\n",
       "      <td>0.409091</td>\n",
       "      <td>0.142857</td>\n",
       "      <td>0.999166</td>\n",
       "      <td>0.0658299</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Pier Luigi Emiliani</td>\n",
       "      <td>3</td>\n",
       "      <td>3</td>\n",
       "      <td>80293</td>\n",
       "      <td>0</td>\n",
       "      <td>0.5</td>\n",
       "      <td>0.833333</td>\n",
       "      <td>1</td>\n",
       "      <td>0.5</td>\n",
       "      <td>0.999963</td>\n",
       "      <td>0.375</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Hidenao Abe</td>\n",
       "      <td>2</td>\n",
       "      <td>5</td>\n",
       "      <td>80291</td>\n",
       "      <td>1</td>\n",
       "      <td>0.285714</td>\n",
       "      <td>2.82143</td>\n",
       "      <td>0.666667</td>\n",
       "      <td>0.285714</td>\n",
       "      <td>0.999925</td>\n",
       "      <td>0.091954</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Mario Lamberger</td>\n",
       "      <td>2</td>\n",
       "      <td>4</td>\n",
       "      <td>80288</td>\n",
       "      <td>5</td>\n",
       "      <td>0.666667</td>\n",
       "      <td>1.66667</td>\n",
       "      <td>0.285714</td>\n",
       "      <td>0.333333</td>\n",
       "      <td>0.999888</td>\n",
       "      <td>0.285714</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>Kaoru Inoue</td>\n",
       "      <td>3</td>\n",
       "      <td>7</td>\n",
       "      <td>80285</td>\n",
       "      <td>4</td>\n",
       "      <td>0.9</td>\n",
       "      <td>2.55</td>\n",
       "      <td>0.428571</td>\n",
       "      <td>0.3</td>\n",
       "      <td>0.999863</td>\n",
       "      <td>0.26087</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>Gabriel Thierrin</td>\n",
       "      <td>2</td>\n",
       "      <td>4</td>\n",
       "      <td>80292</td>\n",
       "      <td>1</td>\n",
       "      <td>0.333333</td>\n",
       "      <td>1</td>\n",
       "      <td>0.666667</td>\n",
       "      <td>0.333333</td>\n",
       "      <td>0.999938</td>\n",
       "      <td>0.25</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>Marcin Gogolewski</td>\n",
       "      <td>2</td>\n",
       "      <td>5</td>\n",
       "      <td>80291</td>\n",
       "      <td>1</td>\n",
       "      <td>0.685714</td>\n",
       "      <td>0.971429</td>\n",
       "      <td>0.666667</td>\n",
       "      <td>0.285714</td>\n",
       "      <td>0.999925</td>\n",
       "      <td>0.413793</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                 author TP  FP     TN  FN  TP_score  FP_score    Recall  \\\n",
       "0  Krzysztof Kaczmarski  4  10  80284   1  0.474359   2.08205       0.8   \n",
       "1  Hector Garcia-Molina  9  29  80242  19  0.272727   4.16364  0.321429   \n",
       "2      Christine Parent  6  22  80263   8  0.206897  0.758621  0.428571   \n",
       "3       Robert Meersman  9  54  80223  13  0.718313   10.1933  0.409091   \n",
       "4   Pier Luigi Emiliani  3   3  80293   0       0.5  0.833333         1   \n",
       "5           Hidenao Abe  2   5  80291   1  0.285714   2.82143  0.666667   \n",
       "6       Mario Lamberger  2   4  80288   5  0.666667   1.66667  0.285714   \n",
       "7           Kaoru Inoue  3   7  80285   4       0.9      2.55  0.428571   \n",
       "8      Gabriel Thierrin  2   4  80292   1  0.333333         1  0.666667   \n",
       "9     Marcin Gogolewski  2   5  80291   1  0.685714  0.971429  0.666667   \n",
       "\n",
       "  Presision  Accuracy AdoptionRate  \n",
       "0  0.285714  0.999863     0.185557  \n",
       "1  0.236842  0.999402    0.0614754  \n",
       "2  0.214286  0.999626     0.214286  \n",
       "3  0.142857  0.999166    0.0658299  \n",
       "4       0.5  0.999963        0.375  \n",
       "5  0.285714  0.999925     0.091954  \n",
       "6  0.333333  0.999888     0.285714  \n",
       "7       0.3  0.999863      0.26087  \n",
       "8  0.333333  0.999938         0.25  \n",
       "9  0.285714  0.999925     0.413793  "
      ]
     },
     "execution_count": 25,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "neo4jpy.to_df(\n",
    "    neo4jpy.query(\"\"\"\n",
    "        WITH [\n",
    "            \"Krzysztof Kaczmarski\", \n",
    "            \"Hector Garcia-Molina\", \n",
    "            \"Christine Parent\", \n",
    "            \"Robert Meersman\", \n",
    "            \"Pier Luigi Emiliani\", \n",
    "            \"Hidenao Abe\", \n",
    "            \"Mario Lamberger\", \n",
    "            \"Kaoru Inoue\", \n",
    "            \"Gabriel Thierrin\", \n",
    "            \"Marcin Gogolewski\"\n",
    "        ] AS author_names\n",
    "        UNWIND author_names AS author_name\n",
    "        MATCH (other:Author)\n",
    "        MATCH (author:Author {name: author_name})\n",
    "        OPTIONAL MATCH (author:Author)-[r:COAUTHOR_TEST]-(other:Author)\n",
    "        WHERE not (author) -[:COAUTHOR_TRAIN]-(other)\n",
    "        WITH \n",
    "            author AS author, \n",
    "            other AS coauthor,\n",
    "            algo.linkprediction.resourceAllocation(author, other, { relationshipQuery: \"COAUTHOR_TRAIN\", direction: \"BOTH\" }) AS score,\n",
    "            count(r) AS in_test\n",
    "        WITH \n",
    "            author,\n",
    "            coauthor,\n",
    "            score,\n",
    "            in_test,\n",
    "            CASE WHEN score > 0 AND in_test = 1 THEN 1 ELSE 0 END AS TP,\n",
    "            CASE WHEN score > 0 AND in_test = 1 THEN score ELSE 0 END AS TP_score,\n",
    "            CASE WHEN score > 0 AND in_test = 0 THEN 1 ELSE 0 END AS FP,\n",
    "            CASE WHEN score > 0 AND in_test = 0 THEN score ELSE 0 END AS FP_score,\n",
    "            CASE WHEN score = 0 AND in_test = 0 THEN 1 ELSE 0 END AS TN,\n",
    "            CASE WHEN score = 0 AND in_test = 1 THEN 1 ELSE 0 END AS FN\n",
    "        WITH \n",
    "            DISTINCT(author) AS author,\n",
    "            SUM(TP) AS TP,\n",
    "            SUM(TP_score) AS TP_score,\n",
    "            SUM(FP) AS FP,\n",
    "            SUM(FP_score) AS FP_score,\n",
    "            SUM(TN) AS TN,\n",
    "            SUM(FN) AS FN\n",
    "        RETURN\n",
    "            author.name AS author,\n",
    "            TP, FP, TN, FN,\n",
    "            TP_score, FP_score,\n",
    "            toFloat(TP) / ( TP + FN ) AS Recall,\n",
    "            toFloat(TP) / ( TP + FP) AS Presision,\n",
    "            toFloat(TP + TN ) / (TP + FP + FN + TN) AS Accuracy,\n",
    "            toFloat(TP_score) / (TP_score + FP_score) AS AdoptionRate\n",
    "    \"\"\"\n",
    "    )\n",
    ")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Total Neighbors algorithm Scores"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Total Neighbors is computed using the following formula:\n",
    "\n",
    "$T N(x, y)=|N(x) \\cup N(y)|$\n",
    "\n",
    "where $N(x)$ is the set of nodes adjacent to $x$, and $N(y)$ is the set of nodes adjacent to $y$.\n",
    "\n",
    "A value of 0 indicates that two nodes are not close, while higher values indicate nodes are closer."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>author</th>\n",
       "      <th>TP</th>\n",
       "      <th>FP</th>\n",
       "      <th>TN</th>\n",
       "      <th>FN</th>\n",
       "      <th>TP_score</th>\n",
       "      <th>FP_score</th>\n",
       "      <th>Recall</th>\n",
       "      <th>Presision</th>\n",
       "      <th>Accuracy</th>\n",
       "      <th>AdoptionRate</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Krzysztof Kaczmarski</td>\n",
       "      <td>5</td>\n",
       "      <td>80294</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>23</td>\n",
       "      <td>403042</td>\n",
       "      <td>1</td>\n",
       "      <td>6.22673e-05</td>\n",
       "      <td>6.22673e-05</td>\n",
       "      <td>5.70628e-05</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Hector Garcia-Molina</td>\n",
       "      <td>28</td>\n",
       "      <td>80271</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>519</td>\n",
       "      <td>804013</td>\n",
       "      <td>1</td>\n",
       "      <td>0.000348697</td>\n",
       "      <td>0.000348697</td>\n",
       "      <td>0.000645096</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Christine Parent</td>\n",
       "      <td>14</td>\n",
       "      <td>80285</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>221</td>\n",
       "      <td>242241</td>\n",
       "      <td>1</td>\n",
       "      <td>0.000174348</td>\n",
       "      <td>0.000174348</td>\n",
       "      <td>0.000911483</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Robert Meersman</td>\n",
       "      <td>22</td>\n",
       "      <td>80277</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>497</td>\n",
       "      <td>1.28574e+06</td>\n",
       "      <td>1</td>\n",
       "      <td>0.000273976</td>\n",
       "      <td>0.000273976</td>\n",
       "      <td>0.000386399</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Pier Luigi Emiliani</td>\n",
       "      <td>3</td>\n",
       "      <td>80296</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>15</td>\n",
       "      <td>322767</td>\n",
       "      <td>1</td>\n",
       "      <td>3.73604e-05</td>\n",
       "      <td>3.73604e-05</td>\n",
       "      <td>4.6471e-05</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Hidenao Abe</td>\n",
       "      <td>3</td>\n",
       "      <td>80296</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>22</td>\n",
       "      <td>483347</td>\n",
       "      <td>1</td>\n",
       "      <td>3.73604e-05</td>\n",
       "      <td>3.73604e-05</td>\n",
       "      <td>4.55139e-05</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Mario Lamberger</td>\n",
       "      <td>7</td>\n",
       "      <td>80292</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>55</td>\n",
       "      <td>483323</td>\n",
       "      <td>1</td>\n",
       "      <td>8.71742e-05</td>\n",
       "      <td>8.71742e-05</td>\n",
       "      <td>0.000113783</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>Kaoru Inoue</td>\n",
       "      <td>7</td>\n",
       "      <td>80292</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>43</td>\n",
       "      <td>483311</td>\n",
       "      <td>1</td>\n",
       "      <td>8.71742e-05</td>\n",
       "      <td>8.71742e-05</td>\n",
       "      <td>8.89617e-05</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>Gabriel Thierrin</td>\n",
       "      <td>3</td>\n",
       "      <td>80296</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>10</td>\n",
       "      <td>322772</td>\n",
       "      <td>1</td>\n",
       "      <td>3.73604e-05</td>\n",
       "      <td>3.73604e-05</td>\n",
       "      <td>3.09807e-05</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>Marcin Gogolewski</td>\n",
       "      <td>3</td>\n",
       "      <td>80296</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>8</td>\n",
       "      <td>322770</td>\n",
       "      <td>1</td>\n",
       "      <td>3.73604e-05</td>\n",
       "      <td>3.73604e-05</td>\n",
       "      <td>2.47848e-05</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                 author  TP     FP TN FN TP_score     FP_score Recall  \\\n",
       "0  Krzysztof Kaczmarski   5  80294  0  0       23       403042      1   \n",
       "1  Hector Garcia-Molina  28  80271  0  0      519       804013      1   \n",
       "2      Christine Parent  14  80285  0  0      221       242241      1   \n",
       "3       Robert Meersman  22  80277  0  0      497  1.28574e+06      1   \n",
       "4   Pier Luigi Emiliani   3  80296  0  0       15       322767      1   \n",
       "5           Hidenao Abe   3  80296  0  0       22       483347      1   \n",
       "6       Mario Lamberger   7  80292  0  0       55       483323      1   \n",
       "7           Kaoru Inoue   7  80292  0  0       43       483311      1   \n",
       "8      Gabriel Thierrin   3  80296  0  0       10       322772      1   \n",
       "9     Marcin Gogolewski   3  80296  0  0        8       322770      1   \n",
       "\n",
       "     Presision     Accuracy AdoptionRate  \n",
       "0  6.22673e-05  6.22673e-05  5.70628e-05  \n",
       "1  0.000348697  0.000348697  0.000645096  \n",
       "2  0.000174348  0.000174348  0.000911483  \n",
       "3  0.000273976  0.000273976  0.000386399  \n",
       "4  3.73604e-05  3.73604e-05   4.6471e-05  \n",
       "5  3.73604e-05  3.73604e-05  4.55139e-05  \n",
       "6  8.71742e-05  8.71742e-05  0.000113783  \n",
       "7  8.71742e-05  8.71742e-05  8.89617e-05  \n",
       "8  3.73604e-05  3.73604e-05  3.09807e-05  \n",
       "9  3.73604e-05  3.73604e-05  2.47848e-05  "
      ]
     },
     "execution_count": 26,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "neo4jpy.to_df(\n",
    "    neo4jpy.query(\"\"\"\n",
    "        WITH [\n",
    "            \"Krzysztof Kaczmarski\", \n",
    "            \"Hector Garcia-Molina\", \n",
    "            \"Christine Parent\", \n",
    "            \"Robert Meersman\", \n",
    "            \"Pier Luigi Emiliani\", \n",
    "            \"Hidenao Abe\", \n",
    "            \"Mario Lamberger\", \n",
    "            \"Kaoru Inoue\", \n",
    "            \"Gabriel Thierrin\", \n",
    "            \"Marcin Gogolewski\"\n",
    "        ] AS author_names\n",
    "        UNWIND author_names AS author_name\n",
    "        MATCH (other:Author)\n",
    "        MATCH (author:Author {name: author_name})\n",
    "        OPTIONAL MATCH (author:Author)-[r:COAUTHOR_TEST]-(other:Author)\n",
    "        WHERE not (author) -[:COAUTHOR_TRAIN]-(other)\n",
    "        WITH \n",
    "            author AS author, \n",
    "            other AS coauthor,\n",
    "            algo.linkprediction.totalNeighbors(author, other, { relationshipQuery: \"COAUTHOR_TRAIN\", direction: \"BOTH\" }) AS score,\n",
    "            count(r) AS in_test\n",
    "        WITH \n",
    "            author,\n",
    "            coauthor,\n",
    "            score,\n",
    "            in_test,\n",
    "            CASE WHEN score > 0 AND in_test = 1 THEN 1 ELSE 0 END AS TP,\n",
    "            CASE WHEN score > 0 AND in_test = 1 THEN score ELSE 0 END AS TP_score,\n",
    "            CASE WHEN score > 0 AND in_test = 0 THEN 1 ELSE 0 END AS FP,\n",
    "            CASE WHEN score > 0 AND in_test = 0 THEN score ELSE 0 END AS FP_score,\n",
    "            CASE WHEN score = 0 AND in_test = 0 THEN 1 ELSE 0 END AS TN,\n",
    "            CASE WHEN score = 0 AND in_test = 1 THEN 1 ELSE 0 END AS FN\n",
    "        WITH \n",
    "            DISTINCT(author) AS author,\n",
    "            SUM(TP) AS TP,\n",
    "            SUM(TP_score) AS TP_score,\n",
    "            SUM(FP) AS FP,\n",
    "            SUM(FP_score) AS FP_score,\n",
    "            SUM(TN) AS TN,\n",
    "            SUM(FN) AS FN\n",
    "        RETURN\n",
    "            author.name AS author,\n",
    "            TP, FP, TN, FN,\n",
    "            TP_score, FP_score,\n",
    "            toFloat(TP) / ( TP + FN ) AS Recall,\n",
    "            toFloat(TP) / ( TP + FP) AS Presision,\n",
    "            toFloat(TP + TN ) / (TP + FP + FN + TN) AS Accuracy,\n",
    "            toFloat(TP_score) / (TP_score + FP_score) AS AdoptionRate\n",
    "    \"\"\")\n",
    ")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Conclussion\n",
    "\n",
    "In general we can see that **AdamicAdar**, **Common Neighbors** and **Resource Allocaiton** have higher accuracy among the algorithms this happens due to the fact that\n",
    "prediction score are clear zero *0.0* when the algorithm does not predict that an edge will happen based on the train set.\n",
    "\n",
    "While **Preferential Attachment** and **Total neighbours** predict a score for all edges. For these algorithms to work in our case we would require a grid search where we could find the best cut off value under which \n",
    "\n",
    "- a **score < value** is accounted for a negative prediction\n",
    "- a **score > value** is accounted for a positive prediction\n",
    "\n",
    "In any case though since our train and test graphs are pretty sparce, and since we try to predict edges for all the **other** not already connected nodes any naive algorithm that would predict only Negatives would also have a very high accuracy."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "---"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.6"
  },
  "toc": {
   "base_numbering": 1,
   "nav_menu": {},
   "number_sections": true,
   "sideBar": true,
   "skip_h1_title": true,
   "title_cell": "Table of Contents",
   "title_sidebar": "Contents",
   "toc_cell": false,
   "toc_position": {
    "height": "calc(100% - 180px)",
    "left": "10px",
    "top": "150px",
    "width": "384px"
   },
   "toc_section_display": true,
   "toc_window_display": true
  },
  "widgets": {
   "application/vnd.jupyter.widget-state+json": {
    "state": {},
    "version_major": 2,
    "version_minor": 0
   }
  }
 },
 "nbformat": 4,
 "nbformat_minor": 4
}
